In [1]:
#Aiswarya Lenin
#Assignment2

In [2]:
import numpy as np
import pandas as pd
#%matplotlib notebook
%matplotlib inline

In [3]:
#import the dataset into a dataframe
df = pd.read_csv("Salaries.csv")

In [4]:
#display the column names
df.head()

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

In [6]:
#another way to display column names
for col in df.columns: 
    print(col)

Id
EmployeeName
JobTitle
BasePay
OvertimePay
OtherPay
Benefits
TotalPay
TotalPayBenefits
Year
Notes
Agency
Status

In [49]:
#display the number of rows and cols
number_of_rows = len(df.axes[0])
print(number_of_rows)

number_of_columns = len(df.axes[1])
print(number_of_columns)
df.shape

87949
13

(87949, 13)

In [13]:
#display the dataframe info (types of data in columns and not null values etc.)
df.dtypes

Id                    int64
EmployeeName         object
JobTitle             object
BasePay             float64
OvertimePay         float64
OtherPay            float64
Benefits            float64
TotalPay            float64
TotalPayBenefits    float64
Year                float64
Notes               float64
Agency               object
Status              float64
dtype: object

In [24]:
#display stats of the dataframe like count, mean, std, max, 25% etc.....
df.describe(include = 'all')

                 Id EmployeeName  ...         Agency  Status
count   87949.00000        87949  ...          87948     0.0
unique          NaN        83210  ...              1     NaN
top             NaN    Kevin Lee  ...  San Francisco     NaN
freq            NaN            9  ...          87948     NaN
mean    43975.00000          NaN  ...            NaN     NaN
std     25388.83375          NaN  ...            NaN     NaN
min         1.00000          NaN  ...            NaN     NaN
25%     21988.00000          NaN  ...            NaN     NaN
50%     43975.00000          NaN  ...            NaN     NaN
75%     65962.00000          NaN  ...            NaN     NaN
max     87949.00000          NaN  ...            NaN     NaN

[11 rows x 13 columns]

In [36]:
#display null values per column
null = df.columns[df.isnull().any()]
print(null)
df[null].isnull().sum()

Index(['BasePay', 'OtherPay', 'Benefits', 'TotalPay', 'TotalPayBenefits',
       'Year', 'Notes', 'Agency', 'Status'],
      dtype='object')

BasePay                 3
OtherPay                1
Benefits            36160
TotalPay                1
TotalPayBenefits        1
Year                    1
Notes               87949
Agency                  1
Status              87949
dtype: int64

In [31]:
#remove columns will all values as NaN
df.dropna(axis = 1, how = 'all')

          Id        EmployeeName  ...    Year         Agency
0          1      NATHANIEL FORD  ...  2011.0  San Francisco
1          2        GARY JIMENEZ  ...  2011.0  San Francisco
2          3      ALBERT PARDINI  ...  2011.0  San Francisco
3          4   CHRISTOPHER CHONG  ...  2011.0  San Francisco
4          5     PATRICK GARDNER  ...  2011.0  San Francisco
...      ...                 ...  ...     ...            ...
87944  87945    Selamawit  Batti  ...  2013.0  San Francisco
87945  87946     Felix J Lagasca  ...  2013.0  San Francisco
87946  87947      Donna A Loftus  ...  2013.0  San Francisco
87947  87948  Thomas A Rodrigues  ...  2013.0  San Francisco
87948  87949         Mark  Brown  ...     NaN            NaN

[87949 rows x 11 columns]

In [32]:
#display number of unique values in each column
df.nunique()

Id                  87949
EmployeeName        83210
JobTitle             2107
BasePay             64487
OvertimePay         41338
OtherPay            53153
Benefits            48684
TotalPay            82351
TotalPayBenefits    84699
Year                    3
Notes                   0
Agency                  1
Status                  0
dtype: int64

In [38]:
#mean of total pay of all people based on year
df.groupby('Year').mean()['TotalPay']

Year
2011.0     71744.103871
2012.0     74113.262265
2013.0    129267.119820
Name: TotalPay, dtype: float64

In [41]:
#how many people have 0 overtime pay
df.OvertimePay[df.OvertimePay==0].count()

44165

In [73]:
#max, min, mean, median and other stats of TotalPay of people having 0 OvertimePay

stats = df[df['OvertimePay'] == 0]['TotalPay']
stats.describe()

count     44165.000000
mean      68042.852864
std       50704.355363
min           0.000000
25%       18754.870000
50%       66869.500000
75%      100269.860000
max      567595.430000
Name: TotalPay, dtype: float64

In [ ]:
#find Id of that person with max TotalPay you got in previous question

In [48]:
#name of employee with total pay benefits = 87619.78

df[df['TotalPay']==87619.78]

          Id  EmployeeName              JobTitle  ...  Notes         Agency  Status
12345  12346  REBECCA CHIU  PRINCIPAL ACCOUNTANT  ...    NaN  San Francisco     NaN

[1 rows x 13 columns]

In [71]:
#how many people have BasePay > 150000 and OvertimePay > 100000
people = df[(df['BasePay']>150000) & (df['OvertimePay']>100000)]
noOfPeople = df[(df['BasePay']>150000) & (df['OvertimePay']>100000)].count()
print(people)
print(noOfPeople)

          Id       EmployeeName  ...         Agency  Status
1          2       GARY JIMENEZ  ...  San Francisco     NaN
2          3     ALBERT PARDINI  ...  San Francisco     NaN
36169  36170       Brendan Ward  ...  San Francisco     NaN
36170  36171         Samson Lai  ...  San Francisco     NaN
36171  36172   Rudy Castellanos  ...  San Francisco     NaN
72927  72928        Samson  Lai  ...  San Francisco     NaN
72941  72942     Mark J Johnson  ...  San Francisco     NaN
72959  72960   Jeffrey J Barden  ...  San Francisco     NaN
72978  72979    Terry W Smerdel  ...  San Francisco     NaN
72979  72980  Kenneth C Cordero  ...  San Francisco     NaN

[10 rows x 13 columns]
Id                  10
EmployeeName        10
JobTitle            10
BasePay             10
OvertimePay         10
OtherPay            10
Benefits             8
TotalPay            10
TotalPayBenefits    10
Year                10
Notes                0
Agency              10
Status               0
dtype: int64

In [64]:
#which job title generally has highest average TotalPayBenefits

df[df['TotalPayBenefits']==df['TotalPayBenefits'].max()]

   Id    EmployeeName  ...         Agency  Status
0   1  NATHANIEL FORD  ...  San Francisco     NaN

[1 rows x 13 columns]

In [72]:
#How many employees are police

df[df['JobTitle'].str.lower().str.contains('police')]['JobTitle'].count()

5859